#ifndef __SH368_BSP_C__
#define __SH368_BSP_C__

#include 	<intrins.h>
#include	"REGSH368.h"

/**********************************************************************************************************
**函数名称  bsp_clock_init()
**函数描述 ：设置内部FRC/2为系统时钟
**输    入 ：无
**输    出 ：无
**说    明 ：快时钟系统主频为 16/2M   默认二分频
**********************************************************************************************************/
void bsp_clock_init()	     
{
//	SELFCK = 0;	         //切换到慢时钟
//		
//	CLKCON = 0x02;       //时钟二分频
////	CLKCON = 0x03;       //时钟一分频
//	
//	STPPCK = 0;			 //开启部分模块使用快时钟
//	STPFCK = 0;			 //开启快时钟
//	SELFCK = 1;			 //切换到快时钟
}

///**********************************************************************************************************
//**函数名称  bsp_SXT_clock_init()
//**函数描述 ：设置SXT外部慢速晶体振荡器/2为系统时钟
//**输    入 ：无
//**输    出 ：无
//**说    明 ：注意 P20 P21需要配置为接外部快速晶振
//**********************************************************************************************************/
void bsp_SXT_clock_init()	     
{
//	SELFCK = 0;	         //切换到慢时钟
//	
//	CLKCON = 0x02;       //时钟二分频 
////	CLKCON = 0x03;       //时钟一分频
//	STPPCK = 0;			 //开启快时钟
//	STPFCK = 0;			 //开启部分模块使用快时钟
//	SELFCK = 1;			 //切换到快时钟
//    SCKTYPE = 1;           //SXT
//	SELFCK = 0;	         //切换到慢时钟
}
#endif